Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.ToolOptionNames.All Field
 The all.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string All = "sel_all"
Public Const All As String = "sel_all"
Field Value
Type: String
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace